In [1]:
import pandas as pd

In [2]:
companis = {'value' : [220, 160, 150, 170, 95], 'Change': [17, 12, -8, -2, 3.5], 'Sector': ['Retail', 'Tech', 'Tech', 'Tech', 'Tech']}

In [3]:
data = pd.DataFrame(companis, index = ['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'])

In [4]:
data

           value  Change  Sector
Amazon       220    17.0  Retail
Google       160    12.0    Tech
Apple        150    -8.0    Tech
Microsoft    170    -2.0    Tech
Samsung       95     3.5    Tech

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Amazon to Samsung
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   Change  5 non-null      float64
 2   Sector  5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 120.0+ bytes

In [7]:
data.columns

Index(['value', 'Change', 'Sector'], dtype='object')

In [8]:
data.index

Index(['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'], dtype='object')

In [9]:
data['Change']

Amazon       17.0
Google       12.0
Apple        -8.0
Microsoft    -2.0
Samsung       3.5
Name: Change, dtype: float64

In [11]:
data.loc[data['value'] > 150]

           value  Change  Sector
Amazon       220    17.0  Retail
Google       160    12.0    Tech
Microsoft    170    -2.0    Tech

In [12]:
data.iloc[3]

value      170
Change      -2
Sector    Tech
Name: Microsoft, dtype: object

In [13]:
data.iloc[1:4, 1:3]

           Change Sector
Google       12.0   Tech
Apple        -8.0   Tech
Microsoft    -2.0   Tech

In [15]:
data[0:4]

           value  Change  Sector
Amazon       220    17.0  Retail
Google       160    12.0    Tech
Apple        150    -8.0    Tech
Microsoft    170    -2.0    Tech

In [16]:
data['Amazon':'Microsoft']

           value  Change  Sector
Amazon       220    17.0  Retail
Google       160    12.0    Tech
Apple        150    -8.0    Tech
Microsoft    170    -2.0    Tech

In [17]:
data['value'].mul(2)

Amazon       440
Google       320
Apple        300
Microsoft    340
Samsung      190
Name: value, dtype: int64

In [20]:
data['value'].sub(2)

Amazon       218
Google       158
Apple        148
Microsoft    168
Samsung       93
Name: value, dtype: int64

In [21]:
data['value'].add(2)

Amazon       222
Google       162
Apple        152
Microsoft    172
Samsung       97
Name: value, dtype: int64

In [22]:
div, rem = divmod(data['value'], 2)

In [23]:
div, rem

(Amazon       110
 Google        80
 Apple         75
 Microsoft     85
 Samsung       47
 Name: value, dtype: int64,
 Amazon       0
 Google       0
 Apple        0
 Microsoft    0
 Samsung      1
 Name: value, dtype: int64)

In [24]:
data

           value  Change  Sector
Amazon       220    17.0  Retail
Google       160    12.0    Tech
Apple        150    -8.0    Tech
Microsoft    170    -2.0    Tech
Samsung       95     3.5    Tech

In [25]:
data.mean()

value     159.0
Change      4.5
dtype: float64

In [26]:
data.sum()

value                        795
Change                      22.5
Sector    RetailTechTechTechTech
dtype: object

In [27]:
data.sum(0)

value                        795
Change                      22.5
Sector    RetailTechTechTechTech
dtype: object

In [28]:
data.sum(1)

Amazon       237.0
Google       172.0
Apple        142.0
Microsoft    168.0
Samsung       98.5
dtype: float64

In [29]:
data.std()

value     44.777226
Change    10.148892
dtype: float64

In [30]:
data.min()

value         95
Change        -8
Sector    Retail
dtype: object

In [31]:
data.cumsum()

           value  Change                  Sector
Amazon       220    17.0                  Retail
Google       380    29.0              RetailTech
Apple        530    21.0          RetailTechTech
Microsoft    700    19.0      RetailTechTechTech
Samsung      795    22.5  RetailTechTechTechTech

In [32]:
data.count()

value     5
Change    5
Sector    5
dtype: int64